{
  "id": 1,
  "name": "Thanh Nguyen Chi Song",
  "title": "Senior Fullstack Engineer",
  "tagline": "Building scalable digital experiences with modern web technologies.",
  "about": "I am a passionate Fullstack Developer with over 6 years of experience in building robust web applications. I specialize in the JavaScript ecosystem, specifically React, TypeScript, and Node.js. My focus is on creating performant, accessible, and visually stunning user interfaces backed by scalable cloud infrastructure.",
  "location": "Ha Noi, Viet Nam",
  "email": "thanhnguyenchisong@gmail.com",
  "phone": "(+84) 972083767",
  "website": "https://thanhnguyenchisong.github.io",
  "avatar": "https://picsum.photos/400/400?grayscale",
  "labels": {
    "skills": {
      "title": "Technical Arsenal",
      "subtitle": "The tools and technologies I use to bring ideas to life."
    },
    "experience": {
      "title": "Career Journey",
      "subtitle": "My professional path and key accomplishments."
    },
    "projects": {
      "title": "Featured Projects",
      "subtitle": "Some things I've built recently."
    },
    "contact": {
      "title": "Let's Work Together",
      "subtitle": "I'm currently open to new opportunities. Whether you have a question, a project idea, or just want to say hi, I'll try my best to get back to you!"
    }
  },
  "experience": [{
    "id": "exp1",
    "role": "Senior Fullstack Engineer",
    "company": "NTTData VDS",
    "period": "2025 - Present",
    "description": "Telekom Project\nDeveloped a middleware application that receives input from multiple external systems, processes and aggregates business logic, and exposes standardized APIs for stakeholders. This solution streamlines data integration across partners and ensures efficient communication within the telecom domain.",
    "achievements": ["Designed and implemented a middleware layer to integrate multiple external systems seamlessly.", "Exposed standardized APIs for stakeholders, improving interoperability and reducing integration complexity.", "Optimized data processing and aggregation logic, ensuring high performance and reliability.", "Enhanced scalability of the system to handle large volumes of telecom data.", "Improved communication efficiency across partners by centralizing input/output flows."]
  }, {
    "id": "1764927030988",
    "role": "Senior Java Developer",
    "company": "NTTData VDS",
    "period": "2022 - 2025",
    "description": "Managed both software and hardware components to streamline automotive software testing processes. Successfully migrated the platform to the cloud, enhancing scalability, reliability, and efficiency in vehicle testing environments.",
    "achievements": ["Led migration of automotive testing platform (Veemos) to cloud infrastructure, improving scalability and reliability.", "Optimized database queries and caching strategies, significantly reducing response times across applications."]
  }, {
    "id": "exp2",
    "role": " Fullstack Developer - Technical Leader",
    "company": "NTTData VDS",
    "period": "2019 - 2022",
    "description": "Developed an analysis UI to visualize and process energy data for improved insights.",
    "achievements": ["Gathered and clarified requirements in user stories; actively participated in all Scrum meetings.", "Led the design, development, and implementation of core business logic.", "Provided guidance and training to team members to enhance productivity and skills.", "Conducted code reviews to ensure quality and maintain best practices.", "Authored technical documentation and user stories to support ongoing development."]
  }, {
    "id": "exp4",
    "role": "Java Developer",
    "company": "NTTData VDS",
    "period": "2017 - 2019",
    "description": "Built a system to collect energy data from multiple sources and expose it via REST APIs for stakeholders.",
    "achievements": ["Gathered and clarified requirements with leaders and business analysts.", "Designed and implemented backend logic to process and aggregate energy data.", "Developed RESTful APIs to deliver standardized energy information to partner teams.", "Ensured scalability and reliability by leveraging distributed databases and messaging systems.", "Collaborated with cross‑functional teams to integrate data pipelines and improve efficiency."]
  }
  ],
  "projects": [],
  "skills": [{
    "id": 1,
    "category": "Frontend",
    "skills": ["Angular", "React", "TypeScript", "Next.js", "Tailwind CSS", "Redux"]
  }, {
    "id": 2,
    "category": "Backend",
    "skills": ["Java", "Go", "PostgreSQL", "MongoDB", "GraphQL", "REST", "Spring", "Quakus"]
  }, {
    "id": 3,
    "category": "DevOps & Tools",
    "skills": ["Docker", "AWS", "CI/CD", "Git", "Linux", "Terraform", "Kubernetes"]
  }
  ],
  "education": [{
    "id": "e1",
    "degree": "Software Engineer",
    "institution": "Posts and Telecommunications Institute of Technology",
    "year": "2017"
  }
  ],
  "socials": [{
    "id": 1,
    "platform": "GitHub",
    "url": "https://github.com",
    "icon": "Github"
  }, {
    "id": 2,
    "platform": "LinkedIn",
    "url": "https://linkedin.com",
    "icon": "Linkedin"
  }, {
    "id": 3,
    "platform": "Twitter",
    "url": "https://twitter.com",
    "icon": "Twitter"
  }
  ]
}